#### Terraform Plan ('src/domains/continua/prod/westeurope') 📖
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.continua_rg will be created
  + resource "azurerm_resource_group" "continua_rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "io-p-continua-rg"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/continua/prod/westeurope"
        }
    }

  # module.app_services.azurerm_monitor_autoscale_setting.appservice_continua will be created
  + resource "azurerm_monitor_autoscale_setting" "appservice_continua" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-app-continua-autoscale"
      + resource_group_name = "io-p-continua-rg"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/continua/prod/westeurope"
        }
      + target_resource_id  = (known after apply)

      + profile {
          + name = "default"

          + capacity {
              + default = 1
              + maximum = 10
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 70
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 5
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = (known after apply)
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT20M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 5
                }
            }
        }
    }

  # module.app_services.azurerm_service_plan.continua will be created
  + resource "azurerm_service_plan" "continua" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-app-continua"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-continua-rg"
      + sku_name                     = "P1v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/continua/prod/westeurope"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.app_services.module.appservice_continua.azurerm_app_service_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.app_services.module.appservice_continua.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "ANDROID_PACKAGE_NAME"                            = "it.pagopa.io.app"
          + "ANDROID_SHA_256_CERT_FINGERPRINTS"               = "7D:E4:FE:3E:AA:E0:83:FF:CD:8B:07:03:01:E8:65:02:D3:F1:EA:D1:DD:66:AC:14:2B:AD:7C:54:47:55:4F:82"
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "FALLBACK_URL"                                    = "https://io.italia.it"
          + "FALLBACK_URL_ON_ANDROID"                         = "https://play.google.com/store/apps/details?id=it.pagopa.io.app"
          + "FALLBACK_URL_ON_IOS"                             = "https://apps.apple.com/it/app/io/id1501681835"
          + "IOS_APP_ID"                                      = "M2X5YQ4BJ7"
          + "IOS_APP_SCHEME"                                  = "ioit://"
          + "IOS_BUNDLE_ID"                                   = "it.pagopa.app.io"
          + "NODE_ENV"                                        = "production"
          + "PORT"                                            = "3000"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "io-p-app-continua"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "io-p-continua-rg"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/continua/prod/westeurope"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "yarn start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 3
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
        }
    }

  # module.app_services.module.appservice_continua_slot_staging.azurerm_app_service_slot_virtual_network_swift_connection.app_service_virtual_network_swift_connection[0] will be created
  + resource "azurerm_app_service_slot_virtual_network_swift_connection" "app_service_virtual_network_swift_connection" {
      + app_service_id = (known after apply)
      + id             = (known after apply)
      + slot_name      = "staging"
      + subnet_id      = (known after apply)
    }

  # module.app_services.module.appservice_continua_slot_staging.azurerm_linux_web_app_slot.this will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "ANDROID_PACKAGE_NAME"                            = "it.pagopa.io.app"
          + "ANDROID_SHA_256_CERT_FINGERPRINTS"               = "7D:E4:FE:3E:AA:E0:83:FF:CD:8B:07:03:01:E8:65:02:D3:F1:EA:D1:DD:66:AC:14:2B:AD:7C:54:47:55:4F:82"
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          + "FALLBACK_URL"                                    = "https://io.italia.it"
          + "FALLBACK_URL_ON_ANDROID"                         = "https://play.google.com/store/apps/details?id=it.pagopa.io.app"
          + "FALLBACK_URL_ON_IOS"                             = "https://apps.apple.com/it/app/io/id1501681835"
          + "IOS_APP_ID"                                      = "M2X5YQ4BJ7"
          + "IOS_APP_SCHEME"                                  = "ioit://"
          + "IOS_BUNDLE_ID"                                   = "it.pagopa.app.io"
          + "NODE_ENV"                                        = "production"
          + "PORT"                                            = "3000"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/continua/prod/westeurope"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_command_line                        = "yarn start"
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + health_check_path                       = "/health"
          + http2_enabled                           = true
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = (known after apply)
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "18-lts"
            }

          + ip_restriction {
              + action                    = "Allow"
              + name                      = "rule"
              + priority                  = 65000
              + virtual_network_subnet_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/subnets/io-p-appgateway-snet"
            }
        }
    }

  # module.networking.module.continua_common_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.17.64/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-continua-common-snet"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-rg-common"
      + service_endpoints                              = [
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-vnet-common"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_service_continua      = {
      + id                  = (known after apply)
      + name                = "io-p-app-continua"
      + resource_group_name = "io-p-continua-rg"
    }
  + app_service_plan_continua = {
      + id   = (known after apply)
      + name = "io-p-app-continua"
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
